Documents/СписаниеПросрочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>СписаниеПросрочки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПросроченныеПартии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПартииЛекарств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лекарство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладе</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Лекарство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПартииЛекарств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПартииЛекарств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПартииЛекарств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПартии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Лекарство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНачальное</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеПросрочки/Forms/ФормаСписка/Ext/Form/Module.bsl
// Модуль формы списка документа СписаниеПросрочки

// Клиентская часть: обработка команды
&НаКлиенте
Процедура СписатьПросрочку(Команда)
    Успешно = Ложь;
    СписатьПросроченныеЛекарстваНаСервере(Успешно);
    
    // Обновляем список, если списание прошло успешно
    Если Успешно Тогда
        Элементы.Список.Обновить();
    КонецЕсли;
КонецПроцедуры

// Серверная часть: логика списания
&НаСервере
Процедура СписатьПросроченныеЛекарстваНаСервере(Успешно)
    ТекущаяДатаСеанса = ТекущаяДата();
    
    // Запрос для поиска просроченных партий через регистр ОстаткиНаСкладе
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ОстаткиНаСкладеОстатки.Партия КАК Партия,
        |   ОстаткиНаСкладеОстатки.Лекарство КАК Лекарство,
        |   ОстаткиНаСкладеОстатки.КоличествоОстаток КАК КоличествоОстаток
        |ПОМЕСТИТЬ ВТОстатки
        |ИЗ
        |   РегистрНакопления.ОстаткиНаСкладе.Остатки(&ТекущаяДата, ) КАК ОстаткиНаСкладеОстатки
        |ГДЕ
        |   ОстаткиНаСкладеОстатки.КоличествоОстаток > 0
        |;
        |
        |ВЫБРАТЬ
        |   ВТОстатки.Партия КАК Партия,
        |   ВТОстатки.Лекарство КАК Лекарство,
        |   ВТОстатки.КоличествоОстаток КАК КоличествоОстаток,
        |   ПартииЛекарствСоставПартии.СрокГодности КАК СрокГодности,
        |   ПартииЛекарств.Дата КАК ДатаПоступления
        |ИЗ
        |   ВТОстатки КАК ВТОстатки
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПартииЛекарств.СоставПартии КАК ПартииЛекарствСоставПартии
        |   ПО ВТОстатки.Партия = ПартииЛекарствСоставПартии.Ссылка
        |   И ВТОстатки.Лекарство = ПартииЛекарствСоставПартии.Лекарство
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПартииЛекарств КАК ПартииЛекарств
        |   ПО ВТОстатки.Партия = ПартииЛекарств.Ссылка
        |ГДЕ
        |   ПартииЛекарствСоставПартии.СрокГодности < &ТекущаяДата";
    
    Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса);
    Выборка = Запрос.Выполнить().Выбрать();
    
    // Создаём документ СписаниеПросрочки
    ДокументСписание = Документы.СписаниеПросрочки.СоздатьДокумент();
    ДокументСписание.Дата = ТекущаяДатаСеанса;
    
    КоличествоСписано = 0;
    
    // Начинаем транзакцию
    НачатьТранзакцию();
    Попытка
        // Обрабатываем каждую просроченную партию
        Пока Выборка.Следующий() Цикл
            Если Выборка.КоличествоОстаток <= 0 Тогда
                Продолжить;
            КонецЕсли;
            
            // Блокируем данные в регистре
            Блокировка = Новый БлокировкаДанных;
            ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНаСкладе");
            ЭлементБлокировки.УстановитьЗначение("Партия", Выборка.Партия);
            ЭлементБлокировки.УстановитьЗначение("Лекарство", Выборка.Лекарство);
            Блокировка.Заблокировать();
            
            // Добавляем строку в табличную часть документа
            НоваяСтрока = ДокументСписание.ПросроченныеПартии.Добавить();
            НоваяСтрока.Партия = Выборка.Партия;
            НоваяСтрока.Лекарство = Выборка.Лекарство;
            НоваяСтрока.Количество = Выборка.КоличествоОстаток;
            НоваяСтрока.СрокГодности = Выборка.СрокГодности;
            
            КоличествоСписано = КоличествоСписано + Выборка.КоличествоОстаток;
            Сообщить("Списана просроченная партия: " + Выборка.Партия + " (Лекарство: " + Выборка.Лекарство + ", Количество: " + Выборка.КоличествоОстаток + ", Срок годности: " + Выборка.СрокГодности + ")", СтатусСообщения.Информация);
        КонецЦикла;
        
        // Проверяем и записываем документ
        Если ДокументСписание.ПросроченныеПартии.Количество() > 0 Тогда
            ДокументСписание.Записать(РежимЗаписиДокумента.Проведение);
            Сообщить("Документ списания успешно проведён.", СтатусСообщения.Информация);
            Успешно = Истина; // Устанавливаем флаг успешного выполнения
        КонецЕсли;
        
        // Фиксируем транзакцию
        ЗафиксироватьТранзакцию();
    Исключение
        // Откат транзакции при ошибке
        Если ТранзакцияАктивна() Тогда
            ОтменитьТранзакцию();
        КонецЕсли;
        Сообщить("Ошибка при обработке: " + ОписаниеОшибки(), СтатусСообщения.Важное);
        Успешно = Ложь; // Устанавливаем флаг неуспешного выполнения
        Возврат;
    КонецПопытки;
    
    // Выводим результат
    Если КоличествоСписано = 0 Тогда
        Сообщить("Просроченных лекарств не найдено.", СтатусСообщения.Информация);
    Иначе
        Сообщить("Списание завершено. Всего списано: " + КоличествоСписано + " единиц.", СтатусСообщения.Информация);
    КонецЕсли;
КонецПроцедуры
